WELCOME = """Привет, это бот игры "Киллер". Каждый год в ЮФМЛ проводится эта игра для общего знакомства. Цель игры "убить" свою цель, получить новую и т.д. Для того чтобы "убить" нужно выполнить следующие условия:

- Вы со своей жертвой должны находиться полностью одни в одной комнате (в кабинете, комнате общежития, на кухне и т.д.). Нельзя "убивать" в туалете, в душевой ОБЩЕЖИТИЯ. В лицее можно "убивать" везде.

- "Убивать" можно только с 8:30 до 22:00

- Вы должны сказать свой жертве: "Бордовая львица кушает пиццу"

- Нельзя трогать жертву или применять насилие ради "убийства".

- Затем жертва должна в телеграмм боте нажать на кнопку "Подтвердить смерть" и вы сразу в своем телеграмм боте получите новую цель.

- Таким образом вы играете до того момента, пока в игре не останется 2 человека - они становятся победителями.
- По всем вопросам обращаться к @lk2322 (72 комната)"""
READ_NAME_1 = """Введите свою Фамилию и Имя(Например "Иванов Иван").
Всех участников проверят на корректность имени, и если вы введёте что-то другое, то вас исключат из игры."""

READ_NAME_2 = """Если вы ввели ФИО неправильно, дождитесь удаления вас из участников и нажмите ещё раз "Участвовать" или сразу обратитесь к администратору @lk2322."""
NAME_ALREADY_EXISTS = """Вы уже участвуете в игре."""
GAME_ALREADY_STARTED = """Игра уже началась, вы не можете присоединиться."""
DEATH_CONFIRMATION = """Вы уверены, что хотите подтвердить смерть?"""
ALREADY_DEAD = """Вы уже мертвы."""
DEATH_CONFIRMED = """Вы погибли"""
DELETED = """Вы были удалены из игры. Возможно вы ввели неправильное ФИО."""